; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v1 ?v3)
             (pred_7 ?v13 ?v7)
             (pred_3 ?v1 ?v7)
             (pred_11 ?v9 ?v1 )
	     (pred_2 ?v1)
             (pred_1 ?v8)
             (pred_4 ?v13)
             (pred_8 ?v7)
             (pred_5 ?v1)
             (pred_12 ?v13)
             (pred_6 ?v1)
             (pred_9 ))



(:action op_2
:parameters (?v12 ?v6 ?v5 ?v2)
:precondition (and (pred_1 ?v12) (pred_1 ?v6) (pred_4 ?v5) (pred_8 ?v2)
          (pred_10 ?v12 ?v6) (pred_7 ?v5 ?v2)
                   (pred_3 ?v6 ?v2) (pred_2 ?v12) 
                   (pred_5 ?v6) (pred_12 ?v5))
:effect (and  (pred_6 ?v6) (not (pred_5 ?v6))))


(:action op_3
:parameters (?v12 ?v4)
:precondition (and (pred_1 ?v12) (pred_1 ?v4)
               (pred_2 ?v12) (pred_10 ?v12 ?v4) (pred_6 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_1 ?v12) (pred_4 ?v5) 
                  (pred_2 ?v12) (pred_11 ?v5 ?v12) (pred_9 ))
:effect (and (pred_12 ?v5)
   (not (pred_11 ?v5 ?v12)) (not (pred_9 ))))


(:action op_4
:parameters (?v12 ?v10 ?v11)
:precondition (and (pred_1 ?v12) (pred_4 ?v10) (pred_4 ?v11)
                  (pred_2 ?v12) (pred_12 ?v11) (pred_11 ?v10 ?v12))
:effect (and (pred_12 ?v10) (pred_11 ?v11 ?v12)
        (not (pred_12 ?v11)) (not (pred_11 ?v10 ?v12))))

(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_1 ?v12) (pred_4 ?v5) 
                  (pred_2 ?v12) (pred_12 ?v5))
:effect (and (pred_9 ) (pred_11 ?v5 ?v12) (not (pred_12 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_24 obj_04 obj_25 obj_28 obj_13 obj_10 obj_01 obj_21 obj_26 obj_30 obj_29 obj_11 obj_09 obj_06 obj_20 obj_05 obj_18 obj_27 obj_19 obj_16 obj_22 obj_03 obj_08 obj_12
    obj_23 obj_17
    obj_02 obj_07 obj_15
    )

    (:init
       (pred_9)

       (pred_1 obj_14)
       (pred_1 obj_24)
       (pred_1 obj_04)
       (pred_1 obj_25)
       (pred_1 obj_28)
       (pred_1 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_01)
       (pred_1 obj_21)
       (pred_1 obj_26)
       (pred_1 obj_30)
       (pred_1 obj_29)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_05)
       (pred_1 obj_18)
       (pred_1 obj_27)
       (pred_1 obj_19)
       (pred_1 obj_16)
       (pred_1 obj_22)
       (pred_1 obj_03)
       (pred_1 obj_08)
       (pred_1 obj_12)
       (pred_8 obj_23)
       (pred_8 obj_17)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_15)

       (pred_10 obj_14 obj_13)
       (pred_10 obj_14 obj_24)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_24 obj_04)
       (pred_10 obj_24 obj_14)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_25)
       (pred_10 obj_04 obj_24)
       (pred_10 obj_25 obj_21)
       (pred_10 obj_25 obj_28)
       (pred_10 obj_25 obj_04)
       (pred_10 obj_28 obj_26)
       (pred_10 obj_28 obj_25)
       (pred_10 obj_13 obj_30)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_14)
       (pred_10 obj_10 obj_29)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_21 obj_09)
       (pred_10 obj_21 obj_26)
       (pred_10 obj_21 obj_25)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_26 obj_06)
       (pred_10 obj_26 obj_28)
       (pred_10 obj_26 obj_21)
       (pred_10 obj_30 obj_20)
       (pred_10 obj_30 obj_29)
       (pred_10 obj_30 obj_13)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_29 obj_11)
       (pred_10 obj_29 obj_10)
       (pred_10 obj_29 obj_30)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_29)
       (pred_10 obj_09 obj_27)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_09 obj_21)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_26)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_20 obj_05)
       (pred_10 obj_20 obj_30)
       (pred_10 obj_05 obj_22)
       (pred_10 obj_05 obj_18)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_05 obj_20)
       (pred_10 obj_18 obj_03)
       (pred_10 obj_18 obj_27)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_05)
       (pred_10 obj_27 obj_08)
       (pred_10 obj_27 obj_19)
       (pred_10 obj_27 obj_09)
       (pred_10 obj_27 obj_18)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_27)
       (pred_10 obj_16 obj_22)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_22 obj_03)
       (pred_10 obj_22 obj_05)
       (pred_10 obj_22 obj_16)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_03 obj_22)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_27)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_12 obj_08)
       (pred_5 obj_26)
       (pred_5 obj_11)
       (pred_5 obj_19)
       (pred_3  obj_26 obj_23)
       (pred_3  obj_11 obj_17)
       (pred_3  obj_19 obj_23)
       (pred_6 obj_14)
       (pred_6 obj_24)
       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_28)
       (pred_6 obj_13)
       (pred_6 obj_10)
       (pred_6 obj_01)
       (pred_6 obj_21)
       (pred_6 obj_30)
       (pred_6 obj_29)
       (pred_6 obj_09)
       (pred_6 obj_06)
       (pred_6 obj_20)
       (pred_6 obj_05)
       (pred_6 obj_18)
       (pred_6 obj_27)
       (pred_6 obj_16)
       (pred_6 obj_22)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_12)

       (pred_7  obj_02 obj_23)
       (pred_7  obj_07 obj_17)
       (pred_7  obj_15 obj_17)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_07 obj_29)
       (pred_11 obj_15 obj_24)
       (pred_2 obj_03)
    )

    (:goal (and
       (pred_11 obj_02 obj_24)
       (pred_11 obj_15 obj_09)
    ))
(:constraints
  (always (not (pred_2 obj_27)))
)
)

; plan
1. (op_3 obj_03 obj_08)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_08)
   goals met: 0 of 2
2. (op_3 obj_08 obj_12)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_12)
   goals met: 0 of 2
3. (op_5 obj_12 obj_02)
   deleted: (pred_11 obj_02 obj_12) (pred_9)
   added: (pred_12 obj_02)
   goals met: 0 of 2
4. (op_2 obj_12 obj_19 obj_02 obj_23)
   deleted: (pred_5 obj_19)
   added: (pred_6 obj_19)
   goals met: 0 of 2
5. (op_3 obj_12 obj_19)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_19)
   goals met: 0 of 2
6. (op_3 obj_19 obj_06)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_06)
   goals met: 0 of 2
7. (op_3 obj_06 obj_09)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_09)
   goals met: 0 of 2
8. (op_3 obj_09 obj_21)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_21)
   goals met: 0 of 2
9. (op_3 obj_21 obj_25)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_25)
   goals met: 0 of 2
10. (op_3 obj_25 obj_04)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_04)
   goals met: 0 of 2
11. (op_3 obj_04 obj_24)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_24)
   goals met: 0 of 2
12. (op_4 obj_24 obj_15 obj_02)
   deleted: (pred_12 obj_02) (pred_11 obj_15 obj_24)
   added: (pred_12 obj_15) (pred_11 obj_02 obj_24)
   goals met: 1 of 2
13. (op_3 obj_24 obj_04)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_04)
   goals met: 1 of 2
14. (op_3 obj_04 obj_25)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_25)
   goals met: 1 of 2
15. (op_3 obj_25 obj_21)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_21)
   goals met: 1 of 2
16. (op_3 obj_21 obj_09)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_09)
   goals met: 1 of 2
17. (op_1 obj_09 obj_15)
   deleted: (pred_12 obj_15)
   added: (pred_9) (pred_11 obj_15 obj_09)
   goals met: 2 of 2
